     A          R TAPINFLR                  PFILE(TAPINFP)       
     A            RDMID                                          
     A            RDVOL                                          
     A            RDMTYP                                         
     A            RDLIB                                          
     A            RDLOC                                          
     A            RDLOCI                                         
     A            RDVSTS                                         
     A            RDWPR                                          
     A          K RDMID                                          